Hi @skreienk,

I tried to create a virtual server without persist, add a persistence and remove it.
Test done on v14, 15 and 16.
All steps were successful and visible in the webui.

main.tf used in step 2:
```terraform
resource "bigip_ltm_virtual_server" "https" {
  name                       = "/Common/terraform_vs_https"
  destination                = "10.255.255.254"
  description                = "VirtualServer-test"
  port                       = 443
  client_profiles            = ["/Common/clientssl"]
  server_profiles            = ["/Common/serverssl"]
  persistence_profiles       = ["/Common/source_addr"]
}
```

1) VS without persistence
```console
ubuntu@ubuntu:~/terraform/vs-persist-1062$ terraform plan -out persist

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_virtual_server.https will be created
  + resource "bigip_ltm_virtual_server" "https" {
      + client_profiles                = [
          + "/Common/clientssl",
        ]
      + default_persistence_profile    = (known after apply)
      + description                    = "VirtualServer-test"
      + destination                    = "10.255.255.254"
      + fallback_persistence_profile   = (known after apply)
      + firewall_enforced_policy       = (known after apply)
      + id                             = (known after apply)
      + ip_protocol                    = "tcp"
      + mask                           = (known after apply)
      + name                           = "/Common/terraform_vs_https"
      + per_flow_request_access_policy = (known after apply)
      + port                           = 443
      + profiles                       = (known after apply)
      + server_profiles                = [
          + "/Common/serverssl",
        ]
      + snatpool                       = (known after apply)
      + source                         = (known after apply)
      + source_address_translation     = (known after apply)
      + source_port                    = (known after apply)
      + state                          = "enabled"
      + trafficmatching_criteria       = (known after apply)
      + translate_address              = "enabled"
      + translate_port                 = "enabled"
      + vlans_enabled                  = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: persist

To perform exactly these actions, run the following command to apply:
    terraform apply "persist"
ubuntu@ubuntu:~/terraform/vs-persist-1062$ terraform apply "persist"
bigip_ltm_virtual_server.https: Creating...
bigip_ltm_virtual_server.https: Creation complete after 1s [id=/Common/terraform_vs_https]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```


2) adding persistence
```console
ubuntu@ubuntu:~/terraform/vs-persist-1062$ terraform plan -out persist
bigip_ltm_virtual_server.https: Refreshing state... [id=/Common/terraform_vs_https]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  ~ update in-place

Terraform will perform the following actions:

  # bigip_ltm_virtual_server.https will be updated in-place
  ~ resource "bigip_ltm_virtual_server" "https" {
        id                             = "/Common/terraform_vs_https"
        name                           = "/Common/terraform_vs_https"
      + persistence_profiles           = [
          + "/Common/source_addr",
        ]
        # (25 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: persist

To perform exactly these actions, run the following command to apply:
    terraform apply "persist"
ubuntu@ubuntu:~/terraform/vs-persist-1062$ terraform apply "persist"
bigip_ltm_virtual_server.https: Modifying... [id=/Common/terraform_vs_https]
bigip_ltm_virtual_server.https: Modifications complete after 0s [id=/Common/terraform_vs_https]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

3) removing persistence
```console
ubuntu@ubuntu:~/terraform/vs-persist-1062$ terraform plan -out persist
bigip_ltm_virtual_server.https: Refreshing state... [id=/Common/terraform_vs_https]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  ~ update in-place

Terraform will perform the following actions:

  # bigip_ltm_virtual_server.https will be updated in-place
  ~ resource "bigip_ltm_virtual_server" "https" {
        id                             = "/Common/terraform_vs_https"
        name                           = "/Common/terraform_vs_https"
      ~ persistence_profiles           = [
          - "/Common/source_addr",
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: persist

To perform exactly these actions, run the following command to apply:
    terraform apply "persist"
ubuntu@ubuntu:~/terraform/vs-persist-1062$ terraform apply "persist"
bigip_ltm_virtual_server.https: Modifying... [id=/Common/terraform_vs_https]
bigip_ltm_virtual_server.https: Modifications complete after 0s [id=/Common/terraform_vs_https]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```